start_uz = "ALGO SIGNAL MM 📊\n\n"
start_ru = "ALGO SIGNAL MM 📊\n\n"
start_en = "ALGO SIGNAL MM 📊\n\n"
end_uz_alter = "\n\n#AlgoSignal @MMFx_Signallar"
end_uz = "\n\n#AlgoSignal @MMFx_UZ"
end_ru = "\n\n#AlgoSignal @MMFX_RU"
end_en = "\n\n#AlgoSignal @MMFX_EN"


UZ = {
    "daily": {
        "from": r"Дневной:\n",
        "to": ""
    },
    "name": {
        "from": r"Si_Money - сигналы форекс\n",
        "to": ""
    },
    "id": {
        "from": r"Порядковый номер сигнала за сегодня -",
        "to": "Signalning tartib raqami -"
    },
    "open_position": {
        "from": r"Открыть позицию -",
        "to": "Pozitsiyani oching -"
    },
    "one": {
        "from": r"Открыть первую позицию -",
        "to": "Birinchi pozitsiyani oching -"
    },
    "two": {
        "from": r"Открыть вторую позицию -",
        "to": "Ikkinchi pozitsiyani oching -"
    },
    "three": {
        "from": r"Открыть третью позицию -",
        "to": "Uchinchi pozitsiyani oching -"
    },
    "four": {
        "from": r"Открыть четвертую позицию -",
        "to": "To'rtinchi pozitsiyani oching -"
    },
    "five": {
        "from": r"Открыть пятую позицию -",
        "to": "Beshinchi pozitsiyani oching -"
    },
    "eight": {
        "from": r"Открыть шестую позицию -",
        "to": "Oltinchi pozitsiyani oching -"
    },
    "seven": {
        "from": r"Открыть седьмую позицию -",
        "to": "Ettinchi pozitsiyani oching -"
    },
    "lot": {
        "from": r"Объем -",
        "to": "LOT -"
    },
    "currency": {
        "from": r"Валютная пара -",
        "to": "Valyuta juftligi -"
    },
    "open_price": {
        "from": r"Цена открытия сделки -",
        "to": "Ochilish narxi -"
    },
    "take_profit": {
        "from": r"Тейк профит -",
        "to": "Foyda olish (Take profit) -"
    },
    "take_profit_all": {
        "from": r"Тейк профит на ВСЕХ открытых позициях ",
        "to": "Foyda olish (Take profit) BARCHA ochiq pozitsiyalarga "
    },
    "set_to": {
        "from": r" установить на ",
        "to": " ornatish qiymati "
    },
    "area": {
        "from": r"Объем для депозита 10.000 USD",
        "to": "Majburiy depozit 10 000 USD"
    },
    "to": {
        "from": r" на ",
        "to": " - "
    },
    "close": {
        "from": r"закрылся",
        "to": "yopildi"
    },
    "closes": {
        "from": r"закрылись",
        "to": "yopildi"
    },
    "wait": {
        "from": r"Здравствуйте уважаемые подписчики. Сегодня сигналов еще не было. "
                r"Ждем подходящих условий для открытия сделок.",
        "to": "Assalomu alaykum aziz obunachilar. Bugun hech qanday signal yo'q edi."
              " Biz tranzaktsiyalarni ochish uchun qulay sharoitlarni kutmoqdamiz."
    },
    "end_day": {
        "from": r"На сегодня всё.",
        "to": "Bugunga shu."
    },
    "end_week": {
        "from": r" Приятных выходных!",
        "to": " Dam olish kunlari muborak bo’lsin!"
    },

}

RU = {
    "daily": {
        "from": r"Дневной:\n",
        "to": ""
    },
    "name": {
        "from": r"Si_Money - сигналы форекс\n",
        "to": ""
    },
    "id": {
        "from": r"Порядковый номер сигнала за сегодня -",
        "to": "Номер сигнала -"
    },
    "open_position": {
        "from": r"Открыть позицию -",
        "to": "Позиция -"
    },
    "one": {
        "from": r"Открыть первую позицию -",
        "to": "Позиция 1 -"
    },
    "two": {
        "from": r"Открыть вторую позицию -",
        "to": "Позиция 2 -"
    },
    "three": {
        "from": r"Открыть третью позицию -",
        "to": "Позиция 3 -"
    },
    "four": {
        "from": r"Открыть четвертую позицию -",
        "to": "Позиция 4 -"
    },
    "five": {
        "from": r"Открыть пятую позицию -",
        "to": "Позиция 5 -"
    },
    "eight": {
        "from": r"Открыть шестую позицию -",
        "to": "Позиция 6 -"
    },
    "seven": {
        "from": r"Открыть седьмую позицию -",
        "to": "Позиция 7 -"
    },
    "lot": {
        "from": r"Объем -",
        "to": "LOT -"
    },
    "currency": {
        "from": r"Валютная пара - ",
        "to": ""
    },
    "open_price": {
        "from": r"Цена открытия сделки -",
        "to": "Точка входа (ТВХ) -"
    },
    "take_profit": {
        "from": r"Тейк профит -",
        "to": "ТП -"
    },
    "take_profit_all": {
        "from": r"Тейк профит на ВСЕХ открытых позициях ",
        "to": "Тейк профит на ВСЕХ открытых позициях "
    },
    "set_to": {
        "from": r" установить на ",
        "to": " установить на "
    },
    "area": {
        "from": r"Объем для депозита 10.000 USD",
        "to": "Депозит 10.000 USD"
    },
    "to": {
        "from": r" на ",
        "to": " на "
    },
    "close": {
        "from": r"закрылся",
        "to": "закрылся"
    },
    "closes": {
        "from": r"закрылись",
        "to": "закрылись"
    },
    "wait": {
        "from": r"Здравствуйте уважаемые подписчики. Сегодня сигналов еще не было. "
                r"Ждем подходящих условий для открытия сделок.",
        "to": "Привет всем, сигналов еще не было. "
              "Ждем."
    },
    "end_day": {
        "from": r"На сегодня всё.",
        "to": "На сегодня всё."
    },
    "end_week": {
        "from": r" Приятных выходных!",
        "to": " Приятных выходных!"
    },

}

EN = {
    "daily": {
        "from": r"Дневной:\n",
        "to": ""
    },
    "name": {
        "from": r"Si_Money - сигналы форекс\n",
        "to": ""
    },
    "id": {
        "from": r"Порядковый номер сигнала за сегодня -",
        "to": "Signal number -"
    },
    "open_position": {
        "from": r"Открыть позицию -",
        "to": "Position -"
    },
    "one": {
        "from": r"Открыть первую позицию -",
        "to": "Position 1 -"
    },
    "two": {
        "from": r"Открыть вторую позицию -",
        "to": "Position 2 -"
    },
    "three": {
        "from": r"Открыть третью позицию -",
        "to": "Position 3 -"
    },
    "four": {
        "from": r"Открыть четвертую позицию -",
        "to": "Position 4 -"
    },
    "five": {
        "from": r"Открыть пятую позицию -",
        "to": "Position 5 -"
    },
    "eight": {
        "from": r"Открыть шестую позицию -",
        "to": "Position 6 -"
    },
    "seven": {
        "from": r"Открыть седьмую позицию -",
        "to": "Position 7 -"
    },
    "lot": {
        "from": r"Объем -",
        "to": "LOT -"
    },
    "currency": {
        "from": r"Валютная пара - ",
        "to": ""
    },
    "open_price": {
        "from": r"Цена открытия сделки -",
        "to": "Entry point (EP) -"
    },
    "take_profit": {
        "from": r"Тейк профит -",
        "to": "TP -"
    },
    "take_profit_all": {
        "from": r"Тейк профит на ВСЕХ открытых позициях ",
        "to": "Take profit on ALL open positions "
    },
    "set_to": {
        "from": r" установить на ",
        "to": " install on "
    },
    "area": {
        "from": r"Объем для депозита 10.000 USD",
        "to": "Deposit 10.000 USD"
    },
    "to": {
        "from": r" на ",
        "to": " to "
    },
    "close": {
        "from": r"закрылся",
        "to": "closed"
    },
    "closes": {
        "from": r"закрылись",
        "to": "closed"
    },
    "wait": {
        "from": r"Здравствуйте уважаемые подписчики. Сегодня сигналов еще не было. "
                r"Ждем подходящих условий для открытия сделок.",
        "to": "Hello, dear subscribers. There have been no signals today."
              "We are waiting for suitable conditions to open transactions."
    },
    "end_day": {
        "from": r"На сегодня всё.",
        "to": "That's all for today."
    },
    "end_week": {
        "from": r" Приятных выходных!",
        "to": " Have a nice weekend!"
    },

}

langs = [UZ, RU, EN]
